ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/crypto/cy_crypto_core_rsa.c
/***************************************************************************//**
* \file cy_crypto_core_rsa.c
* \version 1.0
*
* \brief
*  This file provides the source code to the API to calculate
*  a signature by the RSA method in the Crypto block driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "crypto/cy_crypto_common.h"
#include "crypto/cy_crypto_core_rsa.h"
#include "crypto/cy_crypto_core_instructions.h"
#include "crypto/cy_crypto_core_util.h"
#include "crypto/cy_crypto_core_vu_hw.h"
#include "crypto/cy_crypto_core_vu.h"
#include "crypto/cy_crypto_core_sha.h"
#include "syslib/cy_syslib.h"
#include <string.h>


#if (CY_CPU_CORTEX_M0P)

#define CY_CRYPTO_SHA1_PADDING_SIZE        (15u)
#define CY_CRYPTO_SHA256_512_PADDING_SIZE  (19u)

#if ((CPUSS_CRYPTO_PRESENT == 1) && (CPUSS_CRYPTO_VU == 1) && (CY_CRYPTO_USER_VU == 1))

/* Functions prototypes */
void Cy_Crypto_Core_Rsa_MontCoeff(uint32_t modDerReg, uint32_t modReg, uint32_t size);
void Cy_Crypto_Core_Rsa_BarrettGetU(uint32_t barrettUReg, uint32_t modReg, uint32_t size);
void Cy_Crypto_Core_Rsa_BarretRed(uint32_t resultReg, uint32_t aReg, uint32_t barrettUReg, uint32_t modReg, uint32_t size);
void Cy_Crypto_Core_Rsa_MontTransform(uint32_t z, uint32_t a, uint32_t barrett_u, uint32_t mod, uint32_t size);
void Cy_Crypto_Core_Rsa_MontMul(uint32_t z, uint32_t a, uint32_t b, uint32_t mont_mod_der, uint32_t mod, uint32_t size);

void Cy_Crypto_Core_Rsa_expModByMont(uint32_t y,
                                     uint32_t x,
                                     uint32_t e,
                                     uint32_t n,
                                     uint32_t barretCoef,
                                     uint32_t inverseModulo,
                                     uint32_t rBar,
                                     uint32_t size);

#endif /* #if ((CPUSS_CRYPTO_PRESENT == 1) && (CPUSS_CRYPTO_VU == 1) && (CY_CRYPTO_USER_VU == 1)) */


#if ((CPUSS_CRYPTO_PRESENT == 1) && (CY_CRYPTO_USER_PKCS1_5 == 1))

/* Encodings for hash functions */

#if ((CPUSS_CRYPTO_SHA1 == 1) && (CY_CRYPTO_USER_SHA1 == 1))
static const uint8_t Sha1EncStr[CY_CRYPTO_SHA1_PADDING_SIZE] =
{
    0x14u, 0x04u, 0x00u, 0x05u,
    0x1Au, 0x02u, 0x03u, 0x0Eu, 0x2Bu, 0x05u, 0x06u, 0x09u,
    0x30u, 0x21u, 0x30u
};
#endif /* #if ((CPUSS_CRYPTO_SHA1 == 1) && (CY_CRYPTO_USER_SHA1 == 1)) */

#if ((CPUSS_CRYPTO_SHA256 == 1) && (CY_CRYPTO_USER_SHA256 == 1))
static const uint8_t Sha224EncStr[CY_CRYPTO_SHA256_512_PADDING_SIZE] =
{
    0x1Cu, 0x04u, 0x00u, 0x05u, 0x04u, 0x02u, 0x04u, 0x03u,
    0x65u, 0x01u, 0x48u, 0x86u, 0x60u, 0x09u, 0x06u, 0x0du,
    0x30u, 0x2Du, 0x30u
};

static const uint8_t Sha256EncStr[CY_CRYPTO_SHA256_512_PADDING_SIZE] =
{
    0x20u, 0x04u, 0x00u, 0x05u, 0x01u, 0x02u, 0x04u, 0x03u,
    0x65u, 0x01u, 0x48u, 0x86u, 0x60u, 0x09u, 0x06u, 0x0du,
    0x30u, 0x31u, 0x30u
};
#endif /* #if ((CPUSS_CRYPTO_SHA256 == 1) && (CY_CRYPTO_USER_SHA256 == 1)) */

#if ((CPUSS_CRYPTO_SHA512 == 1) && (CY_CRYPTO_USER_SHA512 == 1))
static const uint8_t Sha384EncStr[CY_CRYPTO_SHA256_512_PADDING_SIZE] =
{
    0x30u, 0x04u, 0x00u, 0x05u, 0x02u, 0x02u, 0x04u, 0x03u,
    0x65u, 0x01u, 0x48u, 0x86u, 0x60u, 0x09u, 0x06u, 0x0du,
    0x30u, 0x41u, 0x30u
};

static const uint8_t Sha512EncStr[CY_CRYPTO_SHA256_512_PADDING_SIZE] =
{
    0x40u, 0x04u, 0x00u, 0x05u, 0x03u, 0x02u, 0x04u, 0x03u,
    0x65u, 0x01u, 0x48u, 0x86u, 0x60u, 0x09u, 0x06u, 0x0du,
    0x30u, 0x51u, 0x30u
};

static const uint8_t Sha512_224EncStr[CY_CRYPTO_SHA256_512_PADDING_SIZE] =
{
    0x1Cu, 0x04u, 0x00u, 0x05u, 0x05u, 0x02u, 0x04u, 0x03u,
    0x65u, 0x01u, 0x48u, 0x86u, 0x60u, 0x09u, 0x06u, 0x0du,
    0x30u, 0x2Du, 0x30u
};

static const uint8_t Sha512_256EncStr[CY_CRYPTO_SHA256_512_PADDING_SIZE] =
{
    0x20u, 0x04u, 0x00u, 0x05u, 0x06u, 0x02u, 0x04u, 0x03u,
    0x65u, 0x01u, 0x48u, 0x86u, 0x60u, 0x09u, 0x06u, 0x0du,
    0x30u, 0x31u, 0x30u
};
#endif /* #if ((CPUSS_CRYPTO_SHA512 == 1) && (CY_CRYPTO_USER_SHA512 == 1)) */

/*******************************************************************************
* Function Name: Cy_Crypto_Core_RsaVerify
****************************************************************************//**
*
* RSA verification with checks for content, paddings and signature format.
* SHA digest of the message and decrypted message should be calculated before.
* Supports only PKCS1-v1_5 format, inside of this format supported padding
* using only SHA, cases with MD2 and MD5 are not supported.
* PKCS1-v1_5 described here, page 31:
* http://www.emc.com/collateral/white-papers/h11300-pkcs-1v2-2-rsa-cryptography-standard-wp.pdf
*
* Returns the verification result \ref cy_en_crypto_rsa_ver_result_t.
*
* \param cryptoContextPtr
* Pointer to the RSA context
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_RsaVerify(cy_stc_crypto_context_rsa_ver_t *cryptoContextPtr)
{
    cy_en_crypto_status_t result = CY_CRYPTO_SUCCESS;

    cy_en_crypto_sha_mode_t _digestType       = cryptoContextPtr->digestType;
    uint8_t *_digestPtr                       = (uint8_t*)cryptoContextPtr->hashPtr;
    uint8_t *_decryptedSignaturePtr           = (uint8_t*)cryptoContextPtr->decryptedSignaturePtr;
    uint32_t _decryptedSignatureLength        = cryptoContextPtr->decryptedSignatureLength;
    cy_en_crypto_rsa_ver_result_t *_verResult = cryptoContextPtr->verResult;

    uint8_t *psBeginPtr;
    uint8_t *encodingArrPtr = NULL;
    uint32_t encodingArrSize = 0;
    uint32_t digestSize = 0;
    uint32_t i;
    int32_t psLength;
    int32_t cmpRes = 0;


    switch (_digestType)
    {

#if ((CPUSS_CRYPTO_SHA1 == 1) && (CY_CRYPTO_USER_SHA1 == 1))
    case CY_CRYPTO_MODE_SHA1:
        encodingArrPtr  = (uint8_t*)Sha1EncStr;
        encodingArrSize = sizeof(Sha1EncStr);
        digestSize      = CY_CRYPTO_SHA1_DIGEST_SIZE;
        break;
#endif /* #if ((CPUSS_CRYPTO_SHA1 == 1) && (CY_CRYPTO_USER_SHA1 == 1)) */

#if ((CPUSS_CRYPTO_SHA256 == 1) && (CY_CRYPTO_USER_SHA256 == 1))
    case CY_CRYPTO_MODE_SHA224:
        encodingArrPtr  = (uint8_t*)Sha224EncStr;
        encodingArrSize = sizeof(Sha224EncStr);
        digestSize      = CY_CRYPTO_SHA224_DIGEST_SIZE;
        break;

    case CY_CRYPTO_MODE_SHA256:
        encodingArrPtr  = (uint8_t*)Sha256EncStr;
        encodingArrSize = sizeof(Sha256EncStr);
        digestSize      = CY_CRYPTO_SHA256_DIGEST_SIZE;
        break;
#endif /* #if ((CPUSS_CRYPTO_SHA256 == 1) && (CY_CRYPTO_USER_SHA256 == 1)) */

#if ((CPUSS_CRYPTO_SHA512 == 1) && (CY_CRYPTO_USER_SHA512 == 1))
    case CY_CRYPTO_MODE_SHA384:
        encodingArrPtr  = (uint8_t*)Sha384EncStr;
        encodingArrSize = sizeof(Sha384EncStr);
        digestSize      = CY_CRYPTO_SHA384_DIGEST_SIZE;
        break;

    case CY_CRYPTO_MODE_SHA512:
        encodingArrPtr  = (uint8_t*)Sha512EncStr;
        encodingArrSize = sizeof(Sha512EncStr);
        digestSize      = CY_CRYPTO_SHA512_DIGEST_SIZE;
        break;

    case CY_CRYPTO_MODE_SHA512_224:
        encodingArrPtr  = (uint8_t*)Sha512_224EncStr;
        encodingArrSize = sizeof(Sha512_224EncStr);
        digestSize      = CY_CRYPTO_SHA512_224_DIGEST_SIZE;
        break;

    case CY_CRYPTO_MODE_SHA512_256:
        encodingArrPtr  = (uint8_t*)Sha512_256EncStr;
        encodingArrSize = sizeof(Sha512_256EncStr);
        digestSize      = CY_CRYPTO_SHA512_256_DIGEST_SIZE;
        break;
#endif /* #if ((CPUSS_CRYPTO_SHA512 == 1) && (CY_CRYPTO_USER_SHA512 == 1)) */

    default:
        break;
    }

    /* Fail by default */
    *_verResult = CY_CRYPTO_RSA_VERIFY_FAIL;

