ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/crypto/cy_crypto_core_rsa.c
    /* Check size of decrypted message */
    if (_decryptedSignatureLength < (encodingArrSize + digestSize + 11))
    {
        cmpRes = 1;  /* further checking is not needed */
    }

    psLength = _decryptedSignatureLength - digestSize - encodingArrSize - 3;

    /* Address of start of T string (0xFFs) in padding */
    psBeginPtr = _decryptedSignaturePtr + _decryptedSignatureLength - 3;

    /* Check whether the begin of message is 0x00, 0x01 and after PS string (before T string) is 0x00 byte.*/
    if ( (0 != cmpRes) ||
         (0x00 != *(psBeginPtr + 2)) ||
         (0x01 != *(psBeginPtr + 1)) ||
         (0x00 != *(_decryptedSignaturePtr + _decryptedSignatureLength - psLength - 3)) )
    {
        cmpRes = 1;  /* Further checking is not needed */
    }

    /* Check FFs */
    if (0 == cmpRes )
    {
        for (i = psLength; i > 0; i--)
        {
            if (0xFF != *(psBeginPtr - i + 1))
            {
                cmpRes = 1;  /* Further checking is not needed */
                break;
            }
        }
    }

    /* Check the padding (T string) */
    if (0 == cmpRes)
    {
        cmpRes = memcmp(encodingArrPtr,
                        (_decryptedSignaturePtr + digestSize),
                        encodingArrSize);
    }

    /* Check the digest */
    if (0 == cmpRes)
    {
        _decryptedSignaturePtr = _decryptedSignaturePtr + digestSize - 1;
        for (i = digestSize; i > 0; i--)
        {
             if( *_decryptedSignaturePtr != *_digestPtr )
             {
                 cmpRes = 1;  /* Further checking is not needed */
                 break;
             }
             _decryptedSignaturePtr--;
             _digestPtr++;
        }
    }

    if (0 == cmpRes )
    {
        *_verResult = CY_CRYPTO_RSA_VERIFY_SUCCESS;
    }

    return (result);
}

#endif /* #if ((CPUSS_CRYPTO_PRESENT == 1) && (CY_CRYPTO_USER_PKCS1_5 == 1)) */


#if ((CPUSS_CRYPTO_PRESENT == 1) && (CPUSS_CRYPTO_VU == 1) && (CY_CRYPTO_USER_VU == 1))

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Rsa_MontCoeff
****************************************************************************//**
*
* Calculation of Montgomery coefficients for Montgomery multiplication in GF(p).
*
* Reference: "Montgomery Multiplication", H. S. Warren, Jr., July 2012
* Reference: http://www.hackersdelight.org/MontgomeryMultiplication.pdf
*
* GCD method is used, reference:
* https://en.wikipedia.org/wiki/Binary_GCD_algorithm
*
* Inputs: modulus n, k = number of bits in n;
* Outputs: R^-1 and n' which allows equation: R*R^-1 - n*n' = 1,
* where R = 1 << size.
*
* Leaf function.
*
* \param modDerReg
* Register index for Montgomery coefficient value.
*
* \param modReg
* Register index for modulo value.
*
* \param size
* Size of modulo, in Bits.
*
*******************************************************************************/
void Cy_Crypto_Core_Rsa_MontCoeff(uint32_t modDerReg, uint32_t modReg, uint32_t size)
{
    uint32_t my_mod  = 9;
    uint32_t tmp    = 10;
    uint32_t a      = 11;
    uint32_t b      = 12;
    uint32_t u      = 13;
    uint32_t v      = 14;

    uint16_t status;
    uint16_t a_zero;
    uint16_t u_even;

    CY_CRYPTO_VU_PUSH_REG    ();

    CY_CRYPTO_VU_LD_REG      (v, modDerReg);
    CY_CRYPTO_VU_LD_REG      (my_mod, modReg);

    CY_CRYPTO_VU_ALLOC_MEM   (a, size);
    CY_CRYPTO_VU_ALLOC_MEM   (b, size);
    CY_CRYPTO_VU_ALLOC_MEM   (u, size);

    CY_CRYPTO_VU_SET_TO_ONE  (u);
    CY_CRYPTO_VU_SET_TO_ZERO (v);

    CY_CRYPTO_VU_SET_TO_ZERO (a);
    CY_CRYPTO_VU_SET_REG     (tmp, (size - 1), 1);

    CY_CRYPTO_VU_SET_BIT     (a, tmp);
    CY_CRYPTO_VU_MOV         (b, my_mod);

    while(1)
    {
        Cy_Crypto_Core_WaitForReady();

        CY_CRYPTO_VU_TST(a);

        status = Cy_Crypto_Core_Vu_StatusRead();
        a_zero = status & (1 << CY_CRYPTO_VU_STATUS_ZERO);

        if(a_zero != 0)
        {
            break;
        }

        CY_CRYPTO_VU_LSR1(a, a);

        CY_CRYPTO_VU_TST(u);
        status = Cy_Crypto_Core_Vu_StatusRead();
        u_even = status & (1 << CY_CRYPTO_VU_STATUS_EVEN);

        if(u_even != 0)
        {
            CY_CRYPTO_VU_LSR1(u, u);
            CY_CRYPTO_VU_LSR1(v, v);
        }
        else
        {
            CY_CRYPTO_VU_ADD(u, u, b);
            CY_CRYPTO_VU_LSR1_WITH_CARRY(u, u);
            CY_CRYPTO_VU_LSR1(v, v);
            CY_CRYPTO_VU_SET_BIT(v, tmp);
        }
    }

    CY_CRYPTO_VU_FREE_MEM((1 << a) | (1 << b) | (1 << u));

    CY_CRYPTO_VU_POP_REG();
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Rsa_BarrettGetU
****************************************************************************//**
*
* Calculation of Barrett coefficient for Barrett reduction in GF(p).
*
* The function reduces the size of the Barrett coefficient by removing leading '0' bits.
* This improves the performance of the Barrett reduction (faster multiplication).
* (1 << bit_size) > mod > (1 << (bit_size-1))
*
* barrett_u = (1 << (2 * size)) / mod      NO!!! leading '1' Barrett bit.
*
* Leaf function.
*
* \param barrettUReg
* Register index for Barrett reduction value.
*
* \param modReg
* Register index for modulo value.
*
* \param
* Size modulo size in Bits.
*
*******************************************************************************/
void Cy_Crypto_Core_Rsa_BarrettGetU(uint32_t barrettUReg, uint32_t modReg, uint32_t size)
{
    uint32_t dividend = 0;
    uint32_t t        = 1;
    uint32_t temp     = 2;
    uint32_t sh       = 3;
    int32_t i;

    CY_CRYPTO_VU_ALLOC_MEM(dividend, size+1);
    CY_CRYPTO_VU_ALLOC_MEM(t,        size+1);
    CY_CRYPTO_VU_ALLOC_MEM(temp,     size+1);

    /* (1 << size) – there is probably a more efficient way to initialize this */
    CY_CRYPTO_VU_SET_REG     (sh, size, 1);
    CY_CRYPTO_VU_SET_TO_ZERO (dividend);
    CY_CRYPTO_VU_SET_BIT     (dividend, sh);

    CY_CRYPTO_VU_MOV (temp, dividend);

    CY_CRYPTO_VU_SET_TO_ZERO (barrettUReg);

    for (i = size; i >= 0; i--)
    {
        /* C = (a >= b) */
        CY_CRYPTO_VU_SUB           (t, dividend, modReg);
        CY_CRYPTO_VU_COND_SWAP_REG (CY_CRYPTO_VU_COND_CS, dividend, t);
        CY_CRYPTO_VU_COND_XOR      (CY_CRYPTO_VU_COND_CS, barrettUReg, barrettUReg, temp);
        CY_CRYPTO_VU_LSL1          (dividend, dividend);
        CY_CRYPTO_VU_LSR1          (temp, temp);
    }

