ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/crypto/cy_crypto_core_rsa.c
    CY_CRYPTO_VU_FREE_MEM((1 << dividend) | (1 << temp) | (1 << t));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Rsa_BarretRed
****************************************************************************//**
*
* Barrett reduction in GF(p).
*
* z = a_double mod modulo
*
* t[b-1:0] = z_double >> size
* t        = t * barrett_u
* t        = t + ((z_double >> size) << size)  "for leading '1' Barrett bit"
* t        = t >> size
* t        = t * mod
* u        = z_double - t
* u        = IF (u >= mod) u = u - mod
*
* Leaf function.
*
* \param resultReg
* Register index for Barrett reduced value.
*
* \param aReg
* Register index for non reduced value.
*
* \param barrettUReg
* Register index for Barrett reduction value.
*
* \param modReg
* Register index for modulo value.
*
* \param size
* Bit size.
*
*******************************************************************************/
void Cy_Crypto_Core_Rsa_BarretRed(uint32_t resultReg, uint32_t aReg, uint32_t barrettUReg, uint32_t modReg, uint32_t size)
{
    uint32_t sh       = 0;
    uint32_t t_double = 1;
    uint32_t z_double = 2;

    CY_CRYPTO_VU_ALLOC_MEM      (t_double, 2 * size);
    CY_CRYPTO_VU_ALLOC_MEM      (z_double, 2 * size);

    CY_CRYPTO_VU_SET_REG        (sh, size, 1);


    CY_CRYPTO_VU_LSR            (t_double, aReg, sh);

    CY_CRYPTO_VU_UMUL           (z_double, t_double, barrettUReg);

    CY_CRYPTO_VU_LSL            (t_double, t_double, sh);

    CY_CRYPTO_VU_ADD            (z_double, z_double, t_double);

    CY_CRYPTO_VU_LSR            (z_double, z_double, sh);

    CY_CRYPTO_VU_UMUL           (t_double, z_double, modReg);

    CY_CRYPTO_VU_SUB            (z_double, aReg, t_double);

    /* C = (a >= b) */
    CY_CRYPTO_VU_CMP_SUB        (z_double, modReg);
    CY_CRYPTO_VU_COND_SUB       (CY_CRYPTO_VU_COND_CS, z_double, z_double, modReg);

    CY_CRYPTO_VU_CMP_SUB        (z_double, modReg);
    CY_CRYPTO_VU_COND_SUB       (CY_CRYPTO_VU_COND_CS, z_double, z_double, modReg);

    CY_CRYPTO_VU_MOV            (resultReg, z_double);

    CY_CRYPTO_VU_FREE_MEM       ((1 << z_double) | (1 << t_double));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Rsa_MontTransform
****************************************************************************//**
*
* \brief Conversion to Montgomery representation.
*
* z = (a << size) % mod
*
* \param z
* Register index for Montgomery representation value.
*
* \param a
* Register index for regular representation value.
*
* \param barrett_u
* Register index for Barrett reduction value.
*
* \param mod
* Register index for modulo value.
*
* \param size
* Bit size.
*
*******************************************************************************/
void Cy_Crypto_Core_Rsa_MontTransform(uint32_t z, uint32_t a, uint32_t barrett_u, uint32_t mod, uint32_t size)
{
    uint32_t sh       = 0;
    uint32_t t1_plus2 = 1;
    uint32_t t2_plus2 = 0;
    uint32_t t_double = 2;
    uint32_t a_double = 3;

    CY_CRYPTO_VU_ALLOC_MEM      (t_double, 2 * size);
    CY_CRYPTO_VU_ALLOC_MEM      (a_double, 2 * size);

    CY_CRYPTO_VU_SET_REG        (sh, size, 1);

    CY_CRYPTO_VU_UMUL           (t_double, a, barrett_u);
    CY_CRYPTO_VU_LSR            (a_double, t_double, sh);

    CY_CRYPTO_VU_UMUL           (t_double, a_double, mod);

    CY_CRYPTO_VU_LSL            (a_double, a, sh);

    CY_CRYPTO_VU_ALLOC_MEM      (t2_plus2, size + 2);

    CY_CRYPTO_VU_SUB            (t2_plus2, a_double, t_double);

    CY_CRYPTO_VU_FREE_MEM       ((1 << a_double) | (1 << t_double));
    CY_CRYPTO_VU_ALLOC_MEM      (t1_plus2, size + 2);

    /* Check CARRY = (a >= b) */
    CY_CRYPTO_VU_SUB            (t1_plus2, t2_plus2, mod);
    CY_CRYPTO_VU_COND_SWAP_REG  (CY_CRYPTO_VU_COND_CC, t1_plus2, t2_plus2);

    /* Check CARRY = (a >= b) */
    CY_CRYPTO_VU_SUB            (t2_plus2, t1_plus2, mod);
    CY_CRYPTO_VU_COND_MOV       (CY_CRYPTO_VU_COND_CC, z, t1_plus2);
    CY_CRYPTO_VU_COND_MOV       (CY_CRYPTO_VU_COND_CS, z, t2_plus2);

    CY_CRYPTO_VU_FREE_MEM       ((1 << t2_plus2) | (1 << t1_plus2));
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Rsa_MontMul
****************************************************************************//**
*
* Montgomery multiplication in GF(p).
*
* z = a * b * r % mod
*
* t = mont_a * mont_b
* u = t * mont_mod_der    "only lower 32 bits are needed"
* u = u * mod
* u = u + t
* u = u >> size
* u = IF (u >= mod) u = u - mod
*
* Leaf function.
*
* \param z
* Register index for product value.
*
* \param a
* Register index for multiplicand value.
*
* \param b
* Register index for multiplier value.
*
* \param mont_mod_der
* Register index for Montgomery coefficient value.
*
* \param mod
* Register index for modulo value.
*
* \param size
*  Bit size.
*
*******************************************************************************/
void Cy_Crypto_Core_Rsa_MontMul(uint32_t z, uint32_t a, uint32_t b, uint32_t mont_mod_der, uint32_t mod, uint32_t size)
{
    uint32_t sh       = 0;
    uint32_t t        = 1;
    uint32_t u_double = 2;
    uint32_t t_double = 3;

    uint32_t status = 4;

    CY_CRYPTO_VU_ALLOC_MEM  (t,        size + 1);
    CY_CRYPTO_VU_ALLOC_MEM  (u_double, 2 * size);
    CY_CRYPTO_VU_ALLOC_MEM  (t_double, 2 * size);

    CY_CRYPTO_VU_SET_REG    (sh, size, 1);

    CY_CRYPTO_VU_UMUL       (t_double, a, b);

    /* Only lower 32 bits are needed */
    CY_CRYPTO_VU_UMUL       (t, t_double, mont_mod_der);

    /* Clear the MSB bit (cut to size length) */
    CY_CRYPTO_VU_LSL1(t, t);
    CY_CRYPTO_VU_LSR1(t, t);

    CY_CRYPTO_VU_UMUL       (u_double, t, mod);

    CY_CRYPTO_VU_ADD        (u_double, u_double, t_double);

    CY_CRYPTO_VU_MOV_STATUS_TO_REG (status);

    CY_CRYPTO_VU_LSR          (u_double, u_double, sh);

    CY_CRYPTO_VU_SET_TO_ZERO  (t);
    CY_CRYPTO_VU_SET_REG      (sh, 0, 1);
    CY_CRYPTO_VU_SET_BIT      (t, sh);
    CY_CRYPTO_VU_SET_REG      (sh, size, 1);
    CY_CRYPTO_VU_LSL          (t, t, sh);

    CY_CRYPTO_VU_MOV_REG_TO_STATUS (status);
    Cy_Crypto_Core_WaitForReady();

    CY_CRYPTO_VU_COND_XOR (CY_CRYPTO_VU_COND_CS, u_double, u_double, t);

    /* C = (a >= b) */
    CY_CRYPTO_VU_SUB (t_double, u_double, mod);

    CY_CRYPTO_VU_COND_SWAP_REG (CY_CRYPTO_VU_COND_CS, u_double, t_double);

    CY_CRYPTO_VU_MOV (z, u_double);

    CY_CRYPTO_VU_FREE_MEM ((1 << t_double) | (1 << u_double) | (1 << t));
}

