ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/crypto/cy_crypto_core_rsa.c
/*******************************************************************************
* Function Name: Cy_Crypto_Core_Rsa_expModByMont
****************************************************************************//**
*
* Perform y = x^e mod n using Montgomery reduction technique to speed-up
* calculation. Suitable for cases with short e.
*
* \param y
* Register index for calculated value.
*
* \param x
* Register index for multiplicand value.
*
* \param e
* Register index for exponent value.
*
* \param n
* Register index for modulo value.
*
* \param size
* modulo size, in Bits
*
*******************************************************************************/
void Cy_Crypto_Core_Rsa_expModByMont(uint32_t y,
                                       uint32_t x,
                                       uint32_t e,
                                       uint32_t n,
                                       uint32_t barretCoef,
                                       uint32_t inverseModulo,
                                       uint32_t rBar,
                                       uint32_t size)
{
    int32_t i;
    uint16_t j;
    uint16_t status;
    uint16_t carry;
    uint16_t clsame;

    uint32_t my_y      = 5;
    uint32_t my_x      = 6;
    uint32_t my_e      = 7;
    uint32_t my_n      = 8;
    uint32_t R0_1      = 9;
    uint32_t n_prime   = 10;
    uint32_t temp      = 11;
    uint32_t barrett_u = 12;
    uint32_t x_bar     = 13;
    uint32_t REG       = 14;


    CY_CRYPTO_VU_PUSH_REG();

    CY_CRYPTO_VU_LD_REG(my_x, x);
    CY_CRYPTO_VU_LD_REG(my_y, y);
    CY_CRYPTO_VU_LD_REG(my_e, e);
    CY_CRYPTO_VU_LD_REG(my_n, n);
    CY_CRYPTO_VU_LD_REG(n_prime,   inverseModulo);
    CY_CRYPTO_VU_LD_REG(barrett_u, barretCoef);

    CY_CRYPTO_VU_MOV(my_y, rBar);

    CY_CRYPTO_VU_ALLOC_MEM(R0_1,      size);
    CY_CRYPTO_VU_ALLOC_MEM(x_bar,     size);
    CY_CRYPTO_VU_ALLOC_MEM(temp,      size);

    Cy_Crypto_Core_Rsa_MontTransform(x_bar, my_x, barrett_u, my_n, size);
    Cy_Crypto_Core_WaitForReady();

    CY_CRYPTO_VU_MOV(temp, my_e);
    CY_CRYPTO_VU_SET_TO_ZERO(R0_1);
    CY_CRYPTO_VU_CLSAME(REG, temp, R0_1);

    /* This is needed, otherwise clsame is wrong */
    Cy_Crypto_Core_WaitForReady();

    clsame = Cy_Crypto_Core_Vu_RegDataPtrRead(REG);
    j = Cy_Crypto_Core_Vu_RegSizeRead(temp) + 1 - clsame;
    CY_CRYPTO_VU_SET_REG(REG, clsame, 1);
    CY_CRYPTO_VU_LSL(temp, temp, REG);

    for (i = j; i > 0; i--)
    {

        /* j is number of bits in exponent e */
        Cy_Crypto_Core_Rsa_MontMul(my_y, my_y, my_y, n_prime, my_n, size);
        Cy_Crypto_Core_WaitForReady();

        CY_CRYPTO_VU_LSL1(temp, temp);
        status = Cy_Crypto_Core_Vu_StatusRead();
        carry = status & (1 << CY_CRYPTO_VU_STATUS_CARRY);

        if (carry != 0)
        {
            Cy_Crypto_Core_Rsa_MontMul(my_y, my_y, x_bar, n_prime, my_n, size);
        }
    }

    CY_CRYPTO_VU_SET_TO_ONE(R0_1);
    Cy_Crypto_Core_Rsa_MontMul(my_y, my_y, R0_1, n_prime , my_n, size);

    CY_CRYPTO_VU_FREE_MEM((1 << R0_1) | (1 << x_bar) | (1 << temp));
    CY_CRYPTO_VU_POP_REG();
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Rsa_Proc
****************************************************************************//**
*
* RSA process algorithm based on the Montgomery algorithm
* using Barrett reduction
*
* https://en.wikipedia.org/wiki/RSA_%28cryptosystem%29
*
* \param cryptoContextPtr
* Pointer to the RSA context
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_Rsa_Proc(cy_stc_crypto_context_rsa_t *cryptoContextPtr)
{
    cy_en_crypto_status_t result = CY_CRYPTO_SUCCESS;

    uint8_t *_expPtr             = cryptoContextPtr->keyPtr->pubExpPtr;
    uint32_t _expBitLength       = cryptoContextPtr->keyPtr->pubExpLength;
    uint8_t *_nPtr               = cryptoContextPtr->keyPtr->moduloPtr;
    uint32_t _nBitLength         = cryptoContextPtr->keyPtr->moduloLength;
    uint32_t *_messagePtr        = (uint32_t*)cryptoContextPtr->messagePtr;
    uint32_t _messageByteLength  = cryptoContextPtr->messageLength;
    uint32_t *_resultPtr         = (uint32_t*)cryptoContextPtr->resultPtr;
    uint8_t *_barretCoefPtr      = cryptoContextPtr->keyPtr->barretCoefPtr;
    uint8_t *_inverseModuloPtr   = cryptoContextPtr->keyPtr->inverseModuloPtr;
    uint8_t *_rBarPtr            = cryptoContextPtr->keyPtr->rBarPtr;

    uint32_t _nByteLength      = 0;
    uint32_t _barretByteLength = 0;
    uint32_t _expByteLength    = 0;

    uint32_t yReg              = 5;
    uint32_t xReg              = 6;
    uint32_t eReg              = 7;
    uint32_t modReg            = 8;
    uint32_t inverseModuloReg  = 9;
    uint32_t barrettReg        = 10;
    uint32_t rBarReg           = 11;


    /* Clear all Crypto SRAM before operations */
    memset((void*)CRYPTO->MEM_BUFF, 0x00, CPUSS_CRYPTO_BUFF_SIZE * 4);

    CY_CRYPTO_VU_ALLOC_MEM(yReg,             _nBitLength);
    CY_CRYPTO_VU_ALLOC_MEM(xReg,             _nBitLength);
    CY_CRYPTO_VU_ALLOC_MEM(eReg,             _nBitLength);
    CY_CRYPTO_VU_ALLOC_MEM(modReg,           _nBitLength);
    CY_CRYPTO_VU_ALLOC_MEM(barrettReg,       _nBitLength + 1);
    CY_CRYPTO_VU_ALLOC_MEM(inverseModuloReg, _nBitLength);
    CY_CRYPTO_VU_ALLOC_MEM(rBarReg,          _nBitLength);

    _nByteLength = _nBitLength / 8;
    if ((_nBitLength % 8) != 0)
    {
        _nByteLength += 1;
    }

    _barretByteLength = (_nBitLength + 1) / 8;
    if (((_nBitLength + 1) % 8) != 0)
    {
        _barretByteLength += 1;
    }

    _expByteLength = _expBitLength / 8;
    if ((_expBitLength % 8) != 0)
    {
        _expByteLength += 1;
    }

    memcpy((void*)((uint32_t)CRYPTO->MEM_BUFF + 4 * Cy_Crypto_Core_Vu_RegDataPtrRead(modReg)), _nPtr, _nByteLength);
    memcpy((void*)((uint32_t)CRYPTO->MEM_BUFF + 4 * Cy_Crypto_Core_Vu_RegDataPtrRead(eReg)), _expPtr, _expByteLength);
    memcpy((void*)((uint32_t)CRYPTO->MEM_BUFF + 4 * Cy_Crypto_Core_Vu_RegDataPtrRead(xReg)), _messagePtr, _messageByteLength);

    /* Check coefficients */
    if (_barretCoefPtr == NULL)
    {
        Cy_Crypto_Core_Rsa_BarrettGetU(barrettReg, modReg, _nBitLength);
        Cy_Crypto_Core_WaitForReady();
    }
    else
    {
        memcpy((void*)((uint32_t)CRYPTO->MEM_BUFF + 4 * Cy_Crypto_Core_Vu_RegDataPtrRead(barrettReg)),
               _barretCoefPtr,
               _barretByteLength);
    }

    if (_rBarPtr == NULL)
    {
        /* inverseModuloReg used here as temp variable */
        CY_CRYPTO_VU_SET_TO_ONE(inverseModuloReg);
        Cy_Crypto_Core_Rsa_MontTransform(rBarReg, inverseModuloReg, barrettReg, modReg, _nBitLength);
        Cy_Crypto_Core_WaitForReady();
    }
    else
    {
        memcpy((void*)((uint32_t)CRYPTO->MEM_BUFF + 4 * Cy_Crypto_Core_Vu_RegDataPtrRead(rBarReg)),
               _rBarPtr,
               _nByteLength);
    }

