ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/crypto/cy_crypto_core_rsa.c
    if (_inverseModuloPtr == NULL)
    {
        Cy_Crypto_Core_Rsa_MontCoeff(inverseModuloReg, modReg, _nBitLength);
        Cy_Crypto_Core_WaitForReady();
    }
    else
    {
        memcpy((void*)((uint32_t)CRYPTO->MEM_BUFF + 4 * Cy_Crypto_Core_Vu_RegDataPtrRead(inverseModuloReg)),
               _inverseModuloPtr,
               _nByteLength);
    }

    Cy_Crypto_Core_Rsa_expModByMont(yReg,
                                    xReg,
                                    eReg,
                                    modReg,
                                    barrettReg,
                                    inverseModuloReg,
                                    rBarReg,
                                    _nBitLength);

    Cy_Crypto_Core_Vu_WaitForComplete();

    /* Copy the result to output buffer */
    memcpy((void*)_resultPtr, (void*)((uint32_t)CRYPTO->MEM_BUFF + 4 * Cy_Crypto_Core_Vu_RegDataPtrRead(yReg)), _nByteLength);

    CY_CRYPTO_VU_FREE_MEM((1 << yReg) | (1 << xReg) | (1 << eReg) | (1 << modReg) |
                          (1 << inverseModuloReg) | (1 << barrettReg) | (1 << rBarReg));

    return (result);
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Rsa_Coef
****************************************************************************//**
*
* Calculation constant coefficients to to speed-up Montgomery algorithm.
* These coefficients are:
*                         coefficient for Barrett reduction,
*                         binary inverse of the modulo,
*                         result of (2^moduloLength mod modulo)
*
* \param cryptoContextPtr
* Pointer to the RSA context
*
* \return
* A Crypto status \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_Rsa_Coef(cy_stc_crypto_context_rsa_t *cryptoContextPtr)
{
    cy_en_crypto_status_t result = CY_CRYPTO_SUCCESS;

    uint8_t *_nPtr               = cryptoContextPtr->keyPtr->moduloPtr;
    uint32_t _nBitLength         = cryptoContextPtr->keyPtr->moduloLength;
    uint8_t *_barretCoefPtr      = cryptoContextPtr->keyPtr->barretCoefPtr;
    uint8_t *_inverseModuloPtr   = cryptoContextPtr->keyPtr->inverseModuloPtr;
    uint8_t *_rBarPtr            = cryptoContextPtr->keyPtr->rBarPtr;
    uint32_t _nByteLength;
    uint32_t _barretByteLength;

    uint32_t modReg              = 11;
    uint32_t inverseModuloReg    = 12;
    uint32_t barrettReg          = 13;
    uint32_t rBarReg             = 14;


    /* Clear all Crypto SRAM before operations */
    memset((void*)CRYPTO->MEM_BUFF, 0x00, CPUSS_CRYPTO_BUFF_SIZE * 4);

    CY_CRYPTO_VU_ALLOC_MEM(modReg,           _nBitLength);
    CY_CRYPTO_VU_ALLOC_MEM(barrettReg,       _nBitLength + 1);
    CY_CRYPTO_VU_ALLOC_MEM(inverseModuloReg, _nBitLength);
    CY_CRYPTO_VU_ALLOC_MEM(rBarReg,          _nBitLength);

    _nByteLength = _nBitLength / 8;
    if ((_nBitLength % 8) != 0)
    {
        _nByteLength += 1;
    }

    _barretByteLength = (_nBitLength + 1) / 8;
    if (((_nBitLength + 1) % 8) != 0)
    {
        _barretByteLength += 1;
    }

    /* Copy modulo to Crypto SRAM */
    memcpy((void*)((uint32_t)CRYPTO->MEM_BUFF + 4 * Cy_Crypto_Core_Vu_RegDataPtrRead(modReg)),
           _nPtr,
           _nByteLength);

    Cy_Crypto_Core_Rsa_BarrettGetU(barrettReg, modReg, _nBitLength);
    Cy_Crypto_Core_WaitForReady();

    /* Copy calculated Barrett coefficient */
    memcpy((void*)_barretCoefPtr,
           (void*)((uint32_t)CRYPTO->MEM_BUFF + 4 * Cy_Crypto_Core_Vu_RegDataPtrRead(barrettReg)),
           _barretByteLength);

    /* inverseModuloReg used here as temp variable */
    CY_CRYPTO_VU_SET_TO_ONE(inverseModuloReg);
    Cy_Crypto_Core_Rsa_MontTransform(rBarReg, inverseModuloReg, barrettReg, modReg, _nBitLength);
    Cy_Crypto_Core_WaitForReady();

    /* Copy calculated r-bar = (1 << size) mod modulo */
    memcpy((void*)_rBarPtr,
           (void*)((uint32_t)CRYPTO->MEM_BUFF + 4 * Cy_Crypto_Core_Vu_RegDataPtrRead(rBarReg)),
           _nByteLength);

    Cy_Crypto_Core_Rsa_MontCoeff(inverseModuloReg, modReg, _nBitLength);
    Cy_Crypto_Core_WaitForReady();

    /* Copy calculated inverse modulo */
    memcpy((void*)_inverseModuloPtr,
           (void*)((uint32_t)CRYPTO->MEM_BUFF + 4 * Cy_Crypto_Core_Vu_RegDataPtrRead(inverseModuloReg)),
           _nByteLength);

    CY_CRYPTO_VU_FREE_MEM((1 << modReg) | (1 << inverseModuloReg) | (1 << barrettReg) | (1 << rBarReg));

    return (result);
}

#endif /* #if ((CPUSS_CRYPTO_PRESENT == 1) && (CPUSS_CRYPTO_VU == 1) && (CY_CRYPTO_USER_VU == 1)) */

#endif /* #if (CY_CPU_CORTEX_M0P) */
